let posts = [
`متتضافش يسطا كده recursion وهتعمل stack over flow 
انا بتكلم عن الnull effect والليست واحدة من اهم attribute الnull مينفعش يحصل التعارض ده
`,
`الصعايدة دول يا حبيبي ناس بميت راجل،الكلمة عندهم عهد، والجدعنة في دمهم سابل،الضهر وقت الشدة، والسند لما الدنيا تميل.`,
`دا احنا عندنا مطار حربي يا حبيبي
يعني قريتنا ليها مكان استراتيجي
احسن تكون مفكر تلا بتاعتك دي موجودة ع الخريطة ولا حاجة`,
`انا واحد عارف اللعبة واللي فيها 
مينفعش اتاثر بيها 😂
طباخ السم مش بيدوقو 😂😂`,
`بِيِئْذِينِي نفسيا

مبدئيا احنا بنكتب بالعامية والقادة دي تنطبق على العامية والفصحى على حد سواء مع اختلاف شكل الكتابة ادي جدا

القاعدة العامة للهمزة المتوسطة:
إن كانت الهمزة مفتوحة ومتحركة بعد حرف متحرك: ماثلت حركة ما قبلها مثل: رأب، رئاسة`,
`مفيش مكان للشوي في شبين؟
نادي الجمهورية تاني ينفع نشوي فيه؟
ممكن نطلع على طريق القاصد اللي بيودي على جنزور من شبين على الترعة هناك ونشوي`,
`د ةيرق ةيجذومن ي يبيبح ىعوا ركتفت نا فونم كتعاتب ىد دلب . 
لاما هيا ينبي انحا نيحشرتم ف جمانرب ةيرقلا ةيجذومنلا تحت ةدايق و تاميلعت وضع سلجم بعشلا نبا انتنش رابلا ميم  
ىحبص رودنغلا 2010`,
`تحياتي لمعاليك الغالي ورده لجل ذوقك تستحقها يا مجتهد احسنت كفيت ووفيت يبن محافظتي يا غالي الف تحيه ل شنتنا الحجر`,

`مفيش اي شركة في العالم هتضغطك بالشكل ده في الشغل والتاسكات 
لو حصل تبقا شركة toxic ولازم تسيبها وتشوف غيرها
ف انا مش فاهم الضغط ده ايه الهدف منه 
يعني ايه كل كمية المذاكرة المطلوبة واللابات والمشاريع دي في يومين اجازة عيد عيب يعني`,
`دى قرية نموذجية ي حبيبي اوعى تفتكر ان منوف بتاعتك دى بلد.
امال ايه يبني احنا مترشحين ف برنامج القرية النموذجية تحت قيادة و تعليمات عضو مجلس الشعب ابن شنتنا البار ميم صبحى الغندور 2010`,
`هتكريت بروجكت و تعمل داتا بيز وشوية تيبلز
وبعدين تحط ريليشنز و بعدين تبدأ تعمل ال CRUDs بتاعتك و تظبط ال Repository و تطبق ال SOLID و بعدين تكريت الصفحات
وتديها Authorization + Authentication و بعدين ت Deploy
و شكرا كده بقي معاك بروجكت MVC`,
`انت انسان ذوقه عالي تحياتي لرقي حضرتك ♥️🔥`,
`طريقة عمل البسبوسه 

المقادير
2 كوب من الدقيق 
كوب سكر ناعم
كوب لبن
كوب جوز الهند
كوب سمن
فانيليا
ملعقة كبيرة من البيكنج باودر
فسدق  مطحون
الطريقة
– نخلط الدقيق مع السكر مع اللبن والسمن والبيكنج بودر وجوز الهند فى اناء عميق مع بعضهم
– ندهن صينية بالسمن ونصب فيها الخليط السابق ثم نرش الفسدق على وجه صينية البسبوسه ونغطى الصينية – ثم نتركها لتخمر مدة ساعتين ثم نضع الصينية فى الفرن وبعد نضجها يتم اخراجها من الفرن
وصحتين على قلبك`,
`كنت هجيبلك بس صدقني مش هعرف اجي غير بعد اللاب 
انا لسه بخلص الويندوز فورم ف مش هلحق اخلص واجي فهحضر اللاب من عندي واجيلكم على المعهد ننقعد لحد العصر مثلا وبعدين نروح المكان المتفق عليه`,
`لو راجل تعيد اللى انت قولته ده تانى إنت متعرفش أنا مين؟ أنا كنت الاول على دفعتى فى الكلية الحربية وشاركت فى عمليات كتير فى سينا وفى أماكن تانية برة مصر وجواها وقتلت على الاقل 200 إرهابى و 40 إخوانجى , أنا مدرب على حرب الشوارع وواخد جايزة أفضل قناص في الجيش المصرى تبقى عيل هههه لو فاكر إنك تقدر تقف أدامي ديتك رصاصة , إنت فاكر كلمتك دي هتعدي بالساهل كدة؟ وانت قاعد دلوقتى أنا بتواصل مع الرجالة في قطاع الحرب الالكترونية وقريب هعرف مكانك فاحسن لك لو خايف على حياتك القذرة إبدأ استعد من دلوقتى بس هى مش فارقة عامة أنت كدة كدة ميت بس المهم هتموت إزاى! أنا ممكن أموتك بطرق كتير جدا سواء بأيديا أو بالترسانة العسكرية اللى متاحة ليا , طبعا إنت حاليا عمال تفكر "يا ريتني ما كتبت التعليق ده يا ريتنى ما رديت" بس الكلمة زي الرصاصة صعب ترجعها تاني كان أحسن لك تقطع أيدك قبل ما تكتب الكلام ده بس خلاص يا غبى إنت غلط غلطة وهتدفع تمن غلطتك دى أحسن لك تقول الشهادة لو مسلم أو تدعى لأى رب إنت مؤمن بيه عشان أنت فى عداد الاموات.`,
`الواحد بيحزن لما بيشوف حاجة زي دي  ، بقينا بنقلد الغرب من غير ذرة تفكير، لمجرد اننا نبان كول و جداد و جامدين و مختلفين، ربنا يهديك يبني، انت ملقتش حد يربيك ولا حد يقولك دينك اكيد، ف عشان كدة دخلت ف السكة دي، لأن مفيش حد عاقل هيعمل اللي بتعمله دا`

]


function hello()
{
   
    let idx = Math.floor(Math.random() * posts.length);
    

    var div = document.getElementById("dd");
    
    const p = document.getElementById("post");
    //document.createElement("p");
        p.innerText = posts[idx];
        console.log(p);
        // div.append(p); 
        // div.appendChild(p);
    
    // var p = document.getElementById("post"); 
    // p.innerText="s";
    // console.log(p.innerText);
}